quick/20250611-insecurity-loop.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Insecurity Loop</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/theme/style.css" />
</head>
<body>
<div id="preamble" class="status">
<header>
  <h1><a href="/">thisago's blog</a></h1>
</header>
</div>
<div id="content" class="content">
<h1 class="title">Insecurity Loop</h1>
<link rel="stylesheet" href="/theme/quick.css" />

<p>
If you get insecure from your own insecurity, you'll fail.
</p>

<p>
Same for:
</p>
<ul class="org-ul">
<li>Get anxious of being anxious.</li>
<li>Fear your own fears.</li>
<li>Get stressed of being stressed.</li>
</ul>

<p>
It's like microphony, it gets loud and loud&#x2026; And then, you fuck with something.<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>
</p>

<p>
Don't let yourself enter the Loop from Hell.<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>
</p>

<pre class="example" id="org9fa2551">
       _____
_     /     \
 \   / LOOP  \
 |  |   __    |
 |  |  |  v   |
 |  |  \__    |
 |  |         |
</pre>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">See first rule's sub-chapter <i>Malfunction</i> at <i>12 Rules for Life</i> from Jordan Peterson</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">See chapter 1 of book <i>The Subtle Art of Not Giving a Fuck</i> from Mark Manson</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
See the source code <a href="https://github.com/thisago/blog">here</a>.
</div>
</body>
</html>
